<pre>
VPN Technologies:
  - remote Access VPNs
   - site-to-site VPNs:
    Design:
    - Hub-and-Spoke design
    - Spoke-to-Spoke design
    - Full Mesh design
    - Hybrid design
    - Tiered Hub-and-Spoke design
    Type:
    - GETVPN                                  cisco routers only
    - DMVPN:              tunnel-less         cisco routers only
    - GRE-Based VPN:      tunnel-less         cisco routers only
    - Easy VPN:           tunnel-based        cisco asa 5500 series, cisco vpn 3000 series, and cisco pix firewalls
    - Standard IPsec VPN: tunnel-based        multivendorsPacket
CIA: Confidentiality Integrity Authentication
IPSec:
  AH:
  IP/51
  RFC 3402 Authentication Header          digitaly sign an IP packet / Authentication
    Authenticate the entire IP packet
      transport mode:
        IP|AH header|TCP|Data
      tunnel mode:
        new IP header|AH header|IP|TCP|Data
  ESP:
  IP/50
  RFC 3403 Encapsulation Security Packet  encrypt an IP Packet       / Authentication & Confidentiality
    Authenticate only the IP datagram portion of the IP packet
    transport mode:
        IP|ESP header|TCP|Data|ESP trailer|ESP auth
      tunnel mode:
        new IP header|ESP header|IP|TCP|Data|ESP trailer|ESP auth
  ISAKMP:
     UDP/500
    Internet Security Association and Key Management Protocol IKE RFC 7296 , now also specified as part of the IKE protocol suite
    ISAKMP defines how security associations (SAs) are set up and used to define direct connections between two hosts that are using IPsec
  IKE Phase 1: is the IKE negociation
  IKE Phase 2: is the IPSec  SA exchange
  IKEv1
  IKEv2
  IKE data flow:
    Phase 1:
      IKE policy negociation
      DH
      authenticatio
    Phase 2:
      IPSec SA exchange
    Data flow:
      Data flow
</pre>
GETVPN: Group Encrypted Transport VPN
  In a GETVPN setup, there isnâ€™t a need to negotiate point-to-point IPsec tunnels between members of a group; this means GETVPN is a tunnel-less option.
DMVPN: Dynamic Multipoint VPN (DMVPN)
  mGRE Multipoint GRE
FlexVPN:
  Cisco version of the IKEv2 standard offering for both site-to-site and remote access VPNs.
<h3>GETVPN Group Encrypted Transport VPN:</h3>
<p>
  Resolve the problem of the large number of security associations (SAs), GETVPN uses a single SA for all the group members. Using a single SA eliminates the hub-and-spoke solutions and partial mesh configurations. GETVPN protocol GDOI Group Domain Of Interpretation establishes the SA between the group members.
  GETVPN introduces the concept of <b>trusted group</b>, each VPN router in the trusted group trusts the other routers nad can send traffic to them. All the group members share the a common SA, this results in two distinct important advantages for GETVPN:
    Any group member can decrypt traffic encrypted by any other member.
    Tunnel negociation is not required because GETVPN is a non-tunnel/tunnel-less based solution.
</p>
  <h4>GDOI(Group Domain Of Interest) Protocol:</h4>
<p>
   RFC 6407, in GETVPN the router encrypts the payload and transmits the IP datagram with the original source and destination IP addresses.
</p>
   Original IP Packet:
   <pre>
                                              |           |            |
                                              | IP Header | IP Payload |
                                              |           |            |
   IPSec Site-to-Site Packet
        |               |            |                    |            |
        | New IP Header | ESP Header | Original IP Header | IP Payload |
        |               |            |                    |            |
   GETVPN IP Packet
   |                    |            |                    |            |
   | Original IP Header | ESP Header | Original IP Header | IP Payload |
   |                    |            |                    |            |
   </pre>
  <p>
  GETVPN does not work in NAT environment, tis type of solution is rarely used across the public network such the internet. GETVPN is ideally suited for either MPLS network or a private IP netwok implementation in large entreprises and government entities.
  GETVPN supports IKEv1 and IKEv2.
  GETVPN has three primary components:
    Key Server.
    Group member.
    GDOI protocol.
<h4>Key Server</h4>
Is the most critical device in the GETPVN solution. The minimal components that should be configured on a key server:
<ul>
<li>IKE policy</li>
<li>RSA key for rekeying</li>
<li>IPSec policies</li>
<li>Traffic classification</li>
</ul>
<p>
Key Server is responsible for registering the group emebers, sending out encryption keys and rekeying process that  occurs periodicaly.
It cannot be a group member, GETVPN needs at least one Key Server. Key Server uses the protocol GDOI to communicate with the group members.
<p>
</p>
Upon initialization, a group member registers with the Key Server by using a preshared key or certification PKI. Once a group member is authorized it retrieves the policy configuration and the two keys used for communication with other group members. The Key Server is responsible for maintaining the SA policy, authenticate group members ans provifding session keys for encrypting/decryptig traffic.
Key Server provides two keys for group members:
</p>
<ul>
<li>key encryption key (KEK) protects control plane communication such as rekeying process</li>
<li>traffic encryption key (TEK) responsible for payload encryption between group members, it  supports the IPSec SA that all group members use to encrypt/decryp payloads</li>
</ul>
</p>
  <h4>Group Member</h4>
<p>
  Policy and SA information are retrieved from the Key Server, during the registration the group member provides ID to get the Policy and the keys.
</p>
<p>A group member is a VPN router that is member of GDOI group and can encrypt traffic being sent to any memeber other member since the all use the same IPSec SA.</p>
<p>A fault tolerance is  having a single Key Server, it is possible to have upto 8 Key Servers per group. A group member register to one Server Key, and then the Key Server replicates that information to the primary Key Server The primary Key Server is responsible for maintaining the database of all registered group members and the rekeying synchronization process.</p>
<h4>GETVPN GDOI Protocol</h4>
<p>
Is used as communication mechanusm between the key servers and group members in the VPN. It is protected by IKE phase 1. KEK is useed when the key server pushes a new key to the group members. The key server can use multicast to push the keys or notify them ot the rekeying.
</p>
<h4>GETVPN Security Controls</h4>
<h5>Rekeying</h5>
<p>configured on the key server, is a policy that is pushed out to the group members using KEK before the existing key expires.</p>
<h5>TBAR (Time Based Anti-Replay)</h5>
<p> It is a pseudo time clock established for the group and managed by the key server.</p>
<h5>P-D3P (IP-Delivery Delay Detection Protocol)</h5>
<p> Is designed to address IP delivery delay attacks</p>
<p>IP-D3P is an interoperability feature, which means that the Cisco IOS software and GDOI versions must be the same.</p>
<pre>
Router>enable
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#hostname KS1
KS1(config)#do write memory
Building configuration...
[OK]
KS1(config)#crypto isakmp ?
  aggressive-mode           Disable ISAKMP aggressive mode 
  client                    Set client configuration policy
  default                   ISAKMP default policy
  disconnect-revoked-peers  Disconnect Crypto Session with Revoked Peer
  enable                    Enable ISAKMP
  fragmentation             IKE Fragmentation enabled if required
  identity                  Set the identity which ISAKMP will use
  invalid-spi-recovery      Initiate IKE and send Invalid SPI Notify
  keepalive                 Set a keepalive interval for use with IOS peers
  key                       Set pre-shared key for remote peer
  nat                       Set a nat  keepalive interval for use with IOS
                            peers
  peer                      Set Peer Policy
  policy                    Set policy for an ISAKMP protection suite
  profile                   Define ISAKMP Profiles
  xauth                     Set Extended Authentication values

KS1(config)#crypto isakmp policy 1
KS1(config-isakmp)#encryption aes 128
KS1(config-isakmp)#hash sha256
KS1(config-isakmp)#group 14
KS1(config-isakmp)#lifetime 3600
KS1(config-isakmp)#authentication ?
  pre-share  Pre-Shared Key
  rsa-encr   Rivest-Shamir-Adleman Encryption
  rsa-sig    Rivest-Shamir-Adleman Signature

KS1(config-isakmp)#authentication pre-share
KS1(config-isakmp)#?
ISAKMP commands:
  authentication  Set authentication method for protection suite
  default         Set a command to its defaults
  encryption      Set encryption algorithm for protection suite
  exit            Exit from ISAKMP protection suite configuration mode
  group           Set the Diffie-Hellman group
  hash            Set hash algorithm for protection suite
  lifetime        Set lifetime for ISAKMP security association
  no              Negate a command or set its defaults

KS1(config-isakmp)#exit
KS1(config)#crypto isakmp ?         
  aggressive-mode           Disable ISAKMP aggressive mode 
  client                    Set client configuration policy
  default                   ISAKMP default policy
  disconnect-revoked-peers  Disconnect Crypto Session with Revoked Peer
  enable                    Enable ISAKMP
  fragmentation             IKE Fragmentation enabled if required
  identity                  Set the identity which ISAKMP will use
  invalid-spi-recovery      Initiate IKE and send Invalid SPI Notify
  keepalive                 Set a keepalive interval for use with IOS peers
  key                       Set pre-shared key for remote peer
  nat                       Set a nat  keepalive interval for use with IOS
                            peers
  peer                      Set Peer Policy
  policy                    Set policy for an ISAKMP protection suite
  profile                   Define ISAKMP Profiles
  xauth                     Set Extended Authentication values

KS1(config)#crypto isakmp key ?
  0     Specifies an UNENCRYPTED password will follow
  6     Specifies an ENCRYPTED password will follow
  WORD  The UNENCRYPTED (cleartext) user password

KS1(config)#crypto isakmp key 0 ?
  WORD  The UNENCRYPTED (cleartext) user password

KS1(config)#crypto isakmp key 0 KSGETVPNKEY ?
  address   define shared key with IP address
  hostname  define shared key with hostname

KS1(config)#crypto isakmp key 0 KSGETVPNKEY address 172.16.10.2
KS1(config)#crypto isakmp key 0 KSGETVPNKEY address 172.16.20.2
KS1(config)#crypto isakmp key 0 KSGETVPNKEY address 172.16.30.2
KS1(config)#crypto isakmp ?
  aggressive-mode           Disable ISAKMP aggressive mode 
  client                    Set client configuration policy
  default                   ISAKMP default policy
  disconnect-revoked-peers  Disconnect Crypto Session with Revoked Peer
  enable                    Enable ISAKMP
  fragmentation             IKE Fragmentation enabled if required
  identity                  Set the identity which ISAKMP will use
  invalid-spi-recovery      Initiate IKE and send Invalid SPI Notify
  keepalive                 Set a keepalive interval for use with IOS peers
  key                       Set pre-shared key for remote peer
  nat                       Set a nat  keepalive interval for use with IOS
                            peers
  peer                      Set Peer Policy
  policy                    Set policy for an ISAKMP protection suite
  profile                   Define ISAKMP Profiles
  xauth                     Set Extended Authentication values

KS1(config)#crypto isakmp crypto ipsec ?
% Unrecognized command
KS1(config)#crypto isakmp ?            
  aggressive-mode           Disable ISAKMP aggressive mode 
  client                    Set client configuration policy
  default                   ISAKMP default policy
  disconnect-revoked-peers  Disconnect Crypto Session with Revoked Peer
  enable                    Enable ISAKMP
  fragmentation             IKE Fragmentation enabled if required
  identity                  Set the identity which ISAKMP will use
  invalid-spi-recovery      Initiate IKE and send Invalid SPI Notify
  keepalive                 Set a keepalive interval for use with IOS peers
  key                       Set pre-shared key for remote peer
  nat                       Set a nat  keepalive interval for use with IOS
                            peers
  peer                      Set Peer Policy
  policy                    Set policy for an ISAKMP protection suite
  profile                   Define ISAKMP Profiles
  xauth                     Set Extended Authentication values

KS1(config)#crypto ipsec ?
  df-bit                Handling of encapsulated DF bit.
  fragmentation         Handling of fragmentation of near-MTU sized packets
  ipv4-deny             Configure global ipv4 deny policy.
  nat-transparency      IPsec NAT transparency model
  optional              Enable optional encryption for IPSec
  profile               Configure an ipsec policy profile
  security-association  Security association parameters
  transform-set         Define transform and settings

KS1(config)#crypto ipsec trans
KS1(config)#crypto ipsec transform-set ?
  WORD  Transform set tag

KS1(config)#crypto ipsec transform-set group_5_transform ?
  ah-md5-hmac      AH-HMAC-MD5 transform
  ah-sha-hmac      AH-HMAC-SHA transform
  ah-sha256-hmac   AH-HMAC-SHA256 transform
  ah-sha384-hmac   AH-HMAC-SHA384 transform
  ah-sha512-hmac   AH-HMAC-SHA512 transform
  comp-lzs         IP Compression using the LZS compression algorithm
  esp-3des         ESP transform using 3DES(EDE) cipher (168 bits)
  esp-aes          ESP transform using AES cipher
  esp-des          ESP transform using DES cipher (56 bits)
  esp-gcm          ESP transform using GCM cipher
  esp-gmac         ESP transform using GMAC cipher
  esp-md5-hmac     ESP transform using HMAC-MD5 auth
  esp-null         ESP transform w/o cipher
  esp-seal         ESP transform using SEAL cipher (160 bits)
  esp-sha-hmac     ESP transform using HMAC-SHA auth
  esp-sha256-hmac  ESP transform using HMAC-SHA256 auth
  esp-sha384-hmac  ESP transform using HMAC-SHA384 auth
  esp-sha512-hmac  ESP transform using HMAC-SHA512 auth

KS1(config)#crypto ipsec transform-set group_5_transform_set esp-aes esp-sha-h$
KS1(cfg-crypto-trans)#?
Crypto transform configuration commands:
  default  Set a command to its defaults
  exit     Exit from crypto transform configuration mode
  mode     encapsulation mode (transport/tunnel)
  no       Negate a command or set its defaults

KS1(cfg-crypto-trans)#mode ?
  transport  transport (payload encapsulation) mode
  tunnel     tunnel (datagram encapsulation) mode

KS1(cfg-crypto-trans)#mode tunn
KS1(cfg-crypto-trans)#mode tunnel ?
  <cr>

KS1(cfg-crypto-trans)#mode tunnel 
KS1(cfg-crypto-trans)#?
Crypto transform configuration commands:
  default  Set a command to its defaults
  exit     Exit from crypto transform configuration mode
  mode     encapsulation mode (transport/tunnel)
  no       Negate a command or set its defaults

KS1(cfg-crypto-trans)#exit
KS1(config)#crypt
KS1(config)#crypto ipse
KS1(config)#crypto ipsec ?
  df-bit                Handling of encapsulated DF bit.
  fragmentation         Handling of fragmentation of near-MTU sized packets
  ipv4-deny             Configure global ipv4 deny policy.
  nat-transparency      IPsec NAT transparency model
  optional              Enable optional encryption for IPSec
  profile               Configure an ipsec policy profile
  security-association  Security association parameters
  transform-set         Define transform and settings

KS1(config)#crypto ipsec profile ?
  WORD  Profile name

KS1(config)#crypto ipsec profile profile_1
KS1(ipsec-profile)#?
Crypto Map configuration commands:
  default         Set a command to its defaults
  description     Description of the crypto map statement policy
  dialer          Dialer related commands
  exit            Exit from crypto map configuration mode
  no              Negate a command or set its defaults
  redundancy      Configure HA for this ipsec profile
  responder-only  Do not initiate SAs from this device
  set             Set values for encryption/decryption

KS1(ipsec-profile)#set ?
  group                 Set the san group parameters
  identity              Identity restriction.
  ikev2-profile         Specify ikev2 Profile
  isakmp-profile        Specify isakmp Profile
  mixed-mode            Turn on IPSec mixed-mode
  pfs                   Specify pfs settings
  reverse-route         Reverse Route Injection.
  security-association  Security association parameters
  security-policy       Maximum number of Security Policy entries that can be
                        negotiated with the peer
  transform-set         Specify list of transform sets in priority order

KS1(ipsec-profile)#set trans
KS1(ipsec-profile)#set transform-set group_5_transform_set
KS1(ipsec-profile)#set ?
  group                 Set the san group parameters
  identity              Identity restriction.
  ikev2-profile         Specify ikev2 Profile
  isakmp-profile        Specify isakmp Profile
  mixed-mode            Turn on IPSec mixed-mode
  pfs                   Specify pfs settings
  reverse-route         Reverse Route Injection.
  security-association  Security association parameters
  security-policy       Maximum number of Security Policy entries that can be
                        negotiated with the peer
  transform-set         Specify list of transform sets in priority order

KS1(ipsec-profile)#set secu  
KS1(ipsec-profile)#set security-ass
KS1(ipsec-profile)#set security-association ?
  dfbit      Handling of encapsulated DF bit.
  dummy      Enable transmitting dummy packets
  ecn        Handling of ECN bit
  idle-time  Automatically delete IPSec SAs after a given idle period.
  level      specify a security association granularity level for identities
  lifetime   security association lifetime
  replay     Set replay checking.

KS1(ipsec-profile)#set security-association lifet
KS1(ipsec-profile)#set security-association lifetime ?
  days       Time-based key duration in days
  kilobytes  Volume-based key duration
  seconds    Time-based key duration in seconds

KS1(ipsec-profile)#set security-association lifetime sec
KS1(ipsec-profile)#set security-association lifetime seconds 7200
KS1(ipsec-profile)#?  
Crypto Map configuration commands:
  default         Set a command to its defaults
  description     Description of the crypto map statement policy
  dialer          Dialer related commands
  exit            Exit from crypto map configuration mode
  no              Negate a command or set its defaults
  redundancy      Configure HA for this ipsec profile
  responder-only  Do not initiate SAs from this device
  set             Set values for encryption/decryption

KS1(ipsec-profile)#set ?
  group                 Set the san group parameters
  identity              Identity restriction.
  ikev2-profile         Specify ikev2 Profile
  isakmp-profile        Specify isakmp Profile
  mixed-mode            Turn on IPSec mixed-mode
  pfs                   Specify pfs settings
  reverse-route         Reverse Route Injection.
  security-association  Security association parameters
  security-policy       Maximum number of Security Policy entries that can be
                        negotiated with the peer
  transform-set         Specify list of transform sets in priority order

KS1(ipsec-profile)#exit
KS1(config)#crypto key generate ?
  ec   Generate EC keys for ECDSA
  rsa  Generate RSA keys

KS1(config)#crypto key generate rsa ?
  encryption    Generate a general purpose RSA key pair for signing and
                encryptionxit
  exportable    Allow the key to be exported
  general-keys  Generate a general purpose RSA key pair for signing and
                encryption
  label         Provide a label
  modulus       Provide number of modulus bits on the command line
  on            create key on specified device.
  redundancy    Allow the key to be synced to high-availability peer
  signature     Generate a general purpose RSA key pair for signing and
                encryption
  storage       Store key on specified device
  usage-keys    Generate separate RSA key pairs for signing and encryption
  <cr>

KS1(config)#crypto key generate rsa gener
KS1(config)#crypto key generate rsa general-keys ?
  exportable  Allow the key to be exported
  label       Provide a label
  modulus     Provide number of modulus bits on the command line
  on          create key on specified device.
  redundancy  Allow the key to be synced to high-availability peer
  storage     Store key on specified device
  <cr>

KS1(config)#crypto key generate rsa general-keys label GETKEYS mo
KS1(config)#$generate rsa general-keys label GETKEYS modulus 2048 export     
The name for the keys will be: GETKEYS

% The key modulus size is 2048 bits
% Generating 2048 bit RSA keys, keys will be exportable...
[OK] (elapsed time was 0 seconds)

KS1(config)#
*Jan  3 06:48:57.848: %SSH-5-ENABLED: SSH 1.99 has been enabled
KS1(config)#crypto ?
  call         Configure Crypto Call Admission Control
  dynamic-map  Specify a dynamic crypto map template
  engine       Enter a crypto engine configurable menu
  gdoi         Configure GKM (Group Key Management, GDOI or G-IKEv2) Policy
  gkm          Configure GKM (Group Key Management, GDOI or G-IKEv2) Policy
  identity     Enter a crypto identity list
  ikev2        Configure IKEv2 Options
  ipsec        Configure IPSEC policy
  isakmp       Configure ISAKMP policy
  key          Long term key operations
  keyring      Key ring commands
  logging      logging messages
  map          Enter a crypto map
  mib          Configure Crypto-related MIB Parameters
  pki          Public Key components
  ssl          Configure Crypto SSL Options
  vpn          Configure crypto vpn commands
  xauth        X-Auth parameters

KS1(config)#crypto gdoi ?
  group  Configure a GKM (Group Key Management, GDOI or G-IKEv2) Group

KS1(config)#crypto gdoi group ?
  WORD  Group Namecr
  ipv6  IPv6 GKM (Group Key Management) Group

KS1(config)#crypto gdoi group group_5
KS1(config-gkm-group)#?
GKM (Group Key Management) Group configuration commands:
  client    Set the group client parameters
  default   Set a command to its defaults
  exit      Exit the group mode
  identity  Set the identity of the group
  no        Negate a command or set its defaults
  passive   Set the group in passive mode
  server    Set the group server for of the group

KS1(config-gkm-group)#identity ?
  address  Set the identity of the group as an address
  number   Set the identity of the group as a number

KS1(config-gkm-group)#identity number ?
  <0-4294967295>  Set the group number

KS1(config-gkm-group)#identity number 5
KS1(config-gkm-group)#?
GKM (Group Key Management) Group configuration commands:
  client    Set the group client parameters
  default   Set a command to its defaults
  exit      Exit the group mode
  identity  Set the identity of the group
  no        Negate a command or set its defaults
  passive   Set the group in passive mode
  server    Set the group server for of the group

KS1(config-gkm-group)#server ?
  address   Identify the group server by address
  hostname  Identify the group server by hostname
  local     Configure GKM group server defined locally

KS1(config-gkm-group)#server local
KS1(gkm-local-server)#
*Jan  3 06:50:36.189: %CRYPTO-6-GDOI_ON_OFF: GDOI is ON
KS1(gkm-local-server)#exit
KS1(config-gkm-group)#server local
KS1(gkm-local-server)#?
GKM (Group Key Management, GDOI or G-IKEv2) Local Server configuration
commands:
  address        Configure server source address
  authorization  Configure authorization for the group
  default        Set a command to its defaults
  exit           Exit the group local server mode
  gdoi           Enable GDOI (ISAKMP) Protocol for Registration & Rekey
  gikev2         Enable G-IKEv2 (IKEv2) Protocol for Registration & Rekey
  group          Configure parameters for the group (e.g. Suite-B)
  identifier     Enter Suite-B KSSID (Key Server Sender ID) config mode
  no             Negate a command or set its defaults
  redundancy     Enter cooperative key server configuration mode
  registration   Configure registration for the group
  rekey          Configure rekey policy for the group
  sa             Configure a security association

KS1(gkm-local-server)#rekey
KS1(gkm-local-server)#rekey ?
  acknowledgement  Request group members to acknowledge rekeys
  address          Define the rekey packet format
  algorithm        Set the rekey encryption algorithm
  authentication   Identify the rekey authentication keypair
  lifetime         Define the rekey lifetime
  retransmit       Define the rekey retransmission parameters
  sig-hash         Set rekey signature-hash parameters
  transport        Specify the rekey distribution method

KS1(gkm-local-server)#?     
GKM (Group Key Management, GDOI or G-IKEv2) Local Server configuration
commands:
  address        Configure server source address
  authorization  Configure authorization for the group
  default        Set a command to its defaults
  exit           Exit the group local server mode
  gdoi           Enable GDOI (ISAKMP) Protocol for Registration & Rekey
  gikev2         Enable G-IKEv2 (IKEv2) Protocol for Registration & Rekey
  group          Configure parameters for the group (e.g. Suite-B)
  identifier     Enter Suite-B KSSID (Key Server Sender ID) config mode
  no             Negate a command or set its defaults
  redundancy     Enter cooperative key server configuration mode
  registration   Configure registration for the group
  rekey          Configure rekey policy for the group
  sa             Configure a security association

KS1(gkm-local-server)#rekey trans
KS1(gkm-local-server)#rekey transport un
KS1(gkm-local-server)#rekey transport unicast 
KS1(gkm-local-server)#
*Jan  3 06:51:43.128: %GDOI-5-KS_REKEY_TRANS_2_UNI: Group group_5 transitioned to Unicast Rekey.rekey lige              
KS1(gkm-local-server)#rekey li  
KS1(gkm-local-server)#rekey lifetime seco
KS1(gkm-local-server)#rekey lifetime seconds 86400
KS1(gkm-local-server)#rekey ret
KS1(gkm-local-server)#rekey retransmit 10 number 2
KS1(gkm-local-server)#rekey auth
KS1(gkm-local-server)#rekey authentication ?
  mypubkey  Identify a keypair associated with this device

KS1(gkm-local-server)#rekey authentication mypu
KS1(gkm-local-server)#rekey authentication mypubkey ?
  rsa  Identify an RSA keypair

KS1(gkm-local-server)#rekey authentication mypubkey rsa GETKEYS
KS1(gkm-local-server)#addres ?
  ipv4  Set ipv4 address of local server

KS1(gkm-local-server)#addres ipv4 172.16.0.2
KS1(gkm-local-server)#?
GKM (Group Key Management, GDOI or G-IKEv2) Local Server configuration
commands:
  address        Configure server source address
  authorization  Configure authorization for the group
  default        Set a command to its defaults
  exit           Exit the group local server mode
  gdoi           Enable GDOI (ISAKMP) Protocol for Registration & Rekey
  gikev2         Enable G-IKEv2 (IKEv2) Protocol for Registration & Rekey
  group          Configure parameters for the group (e.g. Suite-B)
  identifier     Enter Suite-B KSSID (Key Server Sender ID) config mode
  no             Negate a command or set its defaults
  redundancy     Enter cooperative key server configuration mode
  registration   Configure registration for the group
  rekey          Configure rekey policy for the group
  sa             Configure a security association

KS1(gkm-local-server)#sa ?
  d3p               Enable IP delivery delay detection protocol for all SAs
                    within the group
  ipsec             Configure an IPsec SA
  pair-wise-keying  Enable KGS pair-wise-keying
  receive-only      Configure SA to work only in inbound direction

KS1(gkm-local-server)#sa ipsec ?
  <1-65535>  Sequence to insert into SA list

KS1(gkm-local-server)#sa ipsec 1
KS1(gkm-sa-ipsec)#profile profile_1
KS1(gkm-sa-ipsec)#match add
KS1(gkm-sa-ipsec)#match address ?
  ipv4  Match ipv4 packets
  ipv6  Match ipv6 packets

KS1(gkm-sa-ipsec)#match address ipv4 ?
  <100-199>    IP access-list number
  <2000-2699>  IP access-list number (expanded range)
  WORD         Access-list name

KS1(gkm-sa-ipsec)#match address ipv4 101
KS1(gkm-sa-ipsec)#rep
KS1(gkm-sa-ipsec)#replay coun
KS1(gkm-sa-ipsec)#replay counter win
KS1(gkm-sa-ipsec)#replay counter window-size 5
KS1(gkm-sa-ipsec)#acc
KS1(gkm-sa-ipsec)#exit
KS1(gkm-local-server)#exit
KS1(config-gkm-group)#exit
KS1(config)#acc
KS1(config)#access
KS1(config)#access-li
KS1(config)#access-list 101 permit ?
  <0-255>  An IP protocol number
  ahp      Authentication Header Protocol
  eigrp    Cisco's EIGRP routing protocol
  esp      Encapsulation Security Payload
  gre      Cisco's GRE tunneling
  icmp     Internet Control Message Protocol
  igmp     Internet Gateway Message Protocol
  ip       Any Internet Protocol
  ipinip   IP in IP tunneling
  nos      KA9Q NOS compatible IP over IP tunneling
  ospf     OSPF routing protocol
  pcp      Payload Compression Protocol
  pim      Protocol Independent Multicast
  tcp      Transmission Control Protocol
  udp      User Datagram Protocol

KS1(config)#access-list 101 permit ip 10.0.0.0 ?
  A.B.C.D  Source wildcard bits

KS1(config)#$ 101 permit ip 10.0.0.0 0.3.255.255 10.0.0.0 0.3.255.255        
KS1(config)#do write memory 
Building configuration...

  [OK]
KS1(config)#
</pre>
<h3>DMVPN (Dynamic Multipoint VPN)</h3>
GRE (Generic Routing Encapsulatio) and NHRP (Next Hop Resolution Protocol)
mGRE (multipoint Generic Routing Encapsulation)
DMVPN uses severals components to achieve either Hub-to-Spoke or Spoke-to-Spoke solution: mGRE, NHRP and IPSec.
<h4>mGRE multipoint Generic Routing Encapsulation</h4>
mGRE enables routers to support multiple GRE tunnels on a single interface.
<p>This single interface can receive inbound GRE connections from dynamically addressed remote site locations and simultaneously support dynamic routing protocols, IP Multicast, and non-IP protocols. </p>
<p>GRE uses IP protocol 47, the GRE limitations:
<ul>
  <li>GRE is not a cryptographic protocol and it does not provide data protection</li>
  <li>GRE can be CPU intensive</li>
  <li>IP MTU and fragmentation issye might occur aith some applications</li>
  <li>Vendors interoperability</li>
</ul>
</p>
<h4>NHRP Next Hop Resolution Protocol</h4>
<p>NHRP is used as the primary communication system for DMVPN hubs to inform spoke devices about other registered spokes. Its a Client/Server protocol, the hub is the server and the spokes are the clients.
The hub maintains a database of the spokes that have successfully registered.
During the registration process, each spoke provides the server with its public IP address and the internal IP address of its GRE tunnel.
</p>
<h4>DMVPN Designs/Phases</h4>
<h4>DMVPN Phase 1</h4>
<p>DMVPN Phase 1 is the first phase that was defined whrn this technology was implemented by Cisco and is strictly <u>designed for Hub-and-Spoke communication only</u>.</p>
<p>Spoke-to-Spoke communication needs to pass through  the hub.</p>
<h4>DMVPN Phase 2</h4>
<p>  In DMVPN Phase 2 Spoke-to-Spoke traffic is allowed and all routers implement multipoint GRE mGRE.</p>
<h4>DMVPN Phase 3</h4>
<p>Cisco modified the CEF (Cisco Express Forwarding) table and the NHRP table so they can work together.</p>
<h3>DMVPN Phase 1 implementation</h3>
<p><ul><li>Crypto IPsec policy configuration</li>
<li>GRE tunnel configuration</li>
<li>NHRP hub-and-spoke configuration</li>
<li>Routing configuration</li></ul></p>
