<?xml version="1.0" encoding="utf-8"?>
<html xmlns="http://www.w3.org/1999/xhtml">
<head><title></title>
</head>
<body>
<pre>ciscoasa&gt; enable ← Unprivileged Mode
password: ← Enter a password here (initially its blank)
ciscoasa# configure terminal ← Privileged Mode
ciscoasa(config)# ← Configuration Mode
ciscoasa(config)# exit ← Back to Privileged Mode
ciscoasa# exit ← Back to Unprivileged Mode
ciscoasa&gt;
</pre>
<p><strong>running-config</strong> is stored in <strong>RAM</strong><br/>
<strong>startup-config</strong> is stored in <strong>Flash</strong></p>
<p>To save the current running-config we can use one of these two commands:</p>
<pre>ciscoasa# copy running-config startup-config</pre>
<pre>ciscoasa# write memory</pre>
<p>ASA mage is a compressed binary file pre-installed on the Flash of the device. The image get decompressed into RAM when the appliance boots-up. Security level is assigned to interfaces(physical/logical sub-interfaces) and it’s a number from 1 to 100 designating how trusted an interface is relative to another interface on the appliance. An interface with with higher security level can access an interface with a lower security level. On the other hand an interface with a lower security level cannot access an interface with a higher security level , without the explicit permission of a security rule (ACL).</p>
<p><strong>Security level 0</strong> is the lowest trusted security level and it is assigned by default to the <strong>outside</strong> interface of the firewall.</p>
<p><strong>Security levels 1 to 99</strong> can be assigned to perimeter security zones (DMZ Zone, Management Zone, Web Servers Zone ect).</p>
<p><strong>Security level 100</strong> is the most trusted security level and it is assigned by default to the <strong>inside</strong> interface on the firewall.</p>
<h3>Securing access to the ASA:</h3>
<h4>Configure a privileged level password:</h4>
<p>By default there is no password for accessing the ASA firewall, the first step in to configure privileged level password.</p>
<pre>ciscoasa(config)# enable password <em>mysecretpassword</em></pre>
<h4>Configure firewall hostname and domain-name:</h4>
<p>The default hostname of the Cisco ASA is ciscoasa without domain-name configured.</p>
<pre>ciscoasa(config)# hostname northen-fw
northern-fw(config)# end
northern-fw# show hostname
northern-fwnorthern-fw# show hostname fqdn
northern-fw
northern-fw# configure terminal
northern-fw(config)# domain-name adminlogs.local
northern-fw(config)# exit
northern-fw# show hostname fqdn
northern-fw.adminlogs.local<br/></pre>
<h4>Enable Remote Command Line Management:</h4>
<pre>northern-fw(config)# username <em>admin</em> privilege <em>15</em> password <em>p@$w0rd</em>
northern-fw(config)# aaa authentication ssh console LOCAL
northern-fw(config)# ssh version 2
northern-fw(config)# ssh <em>192.168.40.0 255.255.255.0 inside</em>
northern-fw(config)# crypto key generate rsa general-keys modulus <em>2048
</em>northern-fw(config)# interface GigabitEthernet0/0
northern-fw(config-if)# nameif <em>inside</em>
northern-fw(config-if)# ip address <em>192.168.40.250 255.255.255.0</em>
northern-fw(config-if)# security-level 100 ⇐ By default “inside” interface is sec-level 100
northern-fw(config-if)# no shutdown
northern-fw(config-if)# end
northern-fw(config)# interface GigabitEthernet0/1
northern-fw(config-if)# nameif <em>outside</em>
northern-fw(config-if)# ip address <em>10.10.10.253 255.255.255.0</em>
northern-fw(config-if)# security-level 0 ⇐ By default “outside” interface is sec-level 0
northern-fw(config-if)# no shutdown
northern-fw(config-if)# end
northern-fw(config)# dns domain-lookup outside 
northern-fw(config)# dns name-server 1.1.1.1
northern-fw(config)# route outside 0.0.0.0 0.0.0.0 10.10.10.254
</pre>
</body>
</html>
